Repository: phwyverysad/Notepads
Catalog: src/Notepads/Strings/*/Settings.resw
Source language: en_us
Languages: th_th

# AboutPage_DependenciesAndReferences_Title.Text
source: Dependencies and References
th_th: การพึ่งพาและการอ้างอิง

# AboutPage_Disclaimer_Content.Text
source: THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
th_th: ซอฟต์แวร์นี้จัดทำขึ้น "ตามสภาพ" โดยไม่มีการรับประกันใดๆ ไม่ว่าโดยชัดแจ้งหรือโดยปริยาย ผู้เขียนหรือผู้ถือลิขสิทธิ์จะไม่รับผิดชอบต่อการเรียกร้อง ค่าเสียหาย หรือความรับผิดชอบอื่นใดอันเกิดจากซอฟต์แวร์นี้

# AboutPage_Disclaimer_Title.Text
source: Disclaimer
th_th: ข้อจำกัดความรับผิดชอบ

# AboutPage_NotepadsShortDescription.Text
source: Free and open source text editor designed and implemented by Jackie (Jiaqi) Liu
th_th: โปรแกรมแก้ไขข้อความฟรีและโอเพ่นซอร์ส ออกแบบและพัฒนาโดย Jackie (Jiaqi) Liu

# AboutPage_Notepads_AuthorContactsTitle.Text
source: To contact the authors:
th_th: ติดต่อผู้พัฒนา:

# AboutPage_Notepads_IssueAndFeatureRequestsTitle.Text
source: For issue reporting and feature requests:
th_th: รายงานปัญหาและขอฟีเจอร์เพิ่มเติม:

# AboutPage_Notepads_SourceCodeTitle.Text
source: Source code is available on Github:
th_th: ซอร์สโค้ดพร้อมใช้งานบน GitHub:

# AboutPage_Notepads_WebsiteTitle.Text
source: For more info, please visit our website:
th_th: ดูข้อมูลเพิ่มเติมได้ที่เว็บไซต์:

# AboutPage_PrivacyStatementTitle.Text
source: Privacy Statement
th_th: คำแถลงความเป็นส่วนตัว

# AboutPage_Title.Content
source: About
th_th: เกี่ยวกับ

# AdvancedPage_StatusBarSettings_ShowHideStatusBarToggleSwitch.OffContent
source: Show status bar
th_th: แสดงแถบสถานะ

# AdvancedPage_StatusBarSettings_ShowHideStatusBarToggleSwitch.OnContent
source: Show status bar
th_th: แสดงแถบสถานะ

# AdvancedPage_StatusBarSettings_Title.Text
source: Status Bar Settings
th_th: การตั้งค่าแถบสถานะ

# AdvancedPage_Title.Content
source: Advanced
th_th: ขั้นสูง

# PersonalizationPage_AccentColorSettings_Title.Text
source: Accent Color
th_th: สีเน้น

source: Use my Windows accent color
th_th: ใช้สีเน้นของ Windows

# PersonalizationPage_BackgroundTintOpacitySettings_Description.Text
source: Acrylic background tint opacity.
th_th: ความทึบของสีพื้นหลังเอฟเฟกต์ Acrylic หมายเหตุ: เอฟเฟกต์ Acrylic จะปิดลงเมื่อเปิดโหมดประหยัดพลังงานหรือปิดเอฟเฟกต์ความโปร่งใสใน Windows

# PersonalizationPage_BackgroundTintOpacitySettings_Title.Text
source: Background Tint Opacity
th_th: ความทึบของสีพื้นหลัง

# PersonalizationPage_ThemeModeSettings_DarkModeRadioButton.Content
source: Dark
th_th: มืด

# PersonalizationPage_ThemeModeSettings_LightModeRadioButton.Content
source: Light
th_th: สว่าง

# PersonalizationPage_ThemeModeSettings_Title.Text
source: Theme Mode
th_th: โหมดชุดรูปแบบ

# PersonalizationPage_ThemeModeSettings_WindowsModeRadioButton.Content
source: Use my Windows mode
th_th: ใช้ตามโหมดของ Windows

# PersonalizationPage_Title.Content
source: Personalization
th_th: การปรับแต่งส่วนบุคคล

# TextAndEditorPage_DecodingSettings_Description.Text
source: Fallback decoding will be used if file's encoding cannot be recognized.
th_th: การถอดรหัสสำรองจะถูกใช้เมื่อไม่สามารถตรวจหาการเข้ารหัสของไฟล์ได้

# TextAndEditorPage_DecodingSettings_Title.Text
source: Fallback Decoding
th_th: การถอดรหัสสำรอง

# TextAndEditorPage_EncodingSettings_Description.Text
source: Only apply to new document.
th_th: มีผลเฉพาะเอกสารใหม่เท่านั้น

# TextAndEditorPage_EncodingSettings_Title.Text
source: Default Encoding
th_th: การเข้ารหัสเริ่มต้น

# TextAndEditorPage_FontSettings_Title.Text
source: Default Font & Size
th_th: แบบอักษรและขนาดเริ่มต้น

# TextAndEditorPage_LineEndingSettings_Description.Text
source: Only apply to new document.
th_th: มีผลเฉพาะเอกสารใหม่เท่านั้น

# TextAndEditorPage_LineEndingSettings_Title.Text
source: Default Line Ending
th_th: การขึ้นบรรทัดใหม่เริ่มต้น

# TextAndEditorPage_TabKeySettings_DefaultRadioButton.Content
source: Default (\t)
th_th: ค่าเริ่มต้น (\t)

# TextAndEditorPage_TabKeySettings_Description.Text
source: Settings for tab key behavior, only apply to new tabs inserted by user.
th_th: การตั้งค่าการทำงานของปุ่ม Tab จะมีผลกับแท็บใหม่ที่พิมพ์โดยผู้ใช้

# TextAndEditorPage_TabKeySettings_EightSpacesRadioButton.Content
source: 8 Spaces
th_th: 8 ช่องว่าง

# TextAndEditorPage_TabKeySettings_FourSpacesRadioButton.Content
source: 4 Spaces
th_th: 4 ช่องว่าง

# TextAndEditorPage_TabKeySettings_Title.Text
source: Tab Key Behavior
th_th: พฤติกรรมของปุ่ม Tab

# TextAndEditorPage_TabKeySettings_TwoSpacesRadioButton.Content
source: 2 Spaces
th_th: 2 ช่องว่าง

# TextAndEditorPage_TextWrappingSettings_Title.Text
source: Text Wrapping
th_th: การตัดคำ

# TextAndEditorPage_TextWrappingSettings_ToggleSwitch.OffContent
source: Wrap word
th_th: ตัดคำ

# TextAndEditorPage_TextWrappingSettings_ToggleSwitch.OnContent
source: Wrap word
th_th: ตัดคำ

# TextAndEditorPage_Title.Content
source: Text & Editor
th_th: ข้อความและตัวแก้ไข

# AboutPage_ChangelogUrl_Title.Text
source: Changelog
th_th: บันทึกการเปลี่ยนแปลง

# AdvancedPage_SessionSnapshotSettings_Description.Text
source: Once enabled, Notepads will remember the current session for next launch and do a periodic session snapshot backup to prevent accidental data loss for uncommitted changes. Notepads will NOT remind you to save your work on app close if this feature is enabled. Please also remember that session snapshot only works in the first or main window of Notepads.
th_th: เมื่อเปิดใช้งาน Notepads จะจดจำเซสชันปัจจุบันสำหรับการเปิดครั้งถัดไป และสำรองข้อมูลเป็นระยะเพื่อป้องกันการสูญหายของข้อมูล Notepads จะไม่แจ้งเตือนให้บันทึกไฟล์เมื่อปิดแอปหากเปิดใช้งานฟีเจอร์นี้

# AdvancedPage_SessionSnapshotSettings_OnOffToggleSwitch.OffContent
source: Enable session snapshot
th_th: เปิดใช้งานการบันทึกเซสชัน

# AdvancedPage_SessionSnapshotSettings_OnOffToggleSwitch.OnContent
source: Enable session snapshot
th_th: เปิดใช้งานการบันทึกเซสชัน

# AdvancedPage_SessionSnapshotSettings_Title.Text
source: Session Snapshot Settings
th_th: การตั้งค่าการบันทึกเซสชัน

source: Highlight misspelled words
th_th: เน้นคำที่สะกดผิด

# TextAndEditorPage_SpellingSettings_Title.Text
source: Spelling
th_th: การสะกดคำ

# AdvancedPage_AlwaysOpenNewWindow_Description.Text
source: Once enabled, Notepads will always open file in a new window instead of creating a new tab.
th_th: เมื่อเปิดใช้งาน Notepads จะเปิดไฟล์ในหน้าต่างใหม่เสมอแทนที่จะสร้างแท็บใหม่

# AdvancedPage_LaunchPreferenceSettings_AlwaysOpenNewWindowToggleSwitch.OffContent
source: Always open new window
th_th: เปิดหน้าต่างใหม่เสมอ

# AdvancedPage_LaunchPreferenceSettings_AlwaysOpenNewWindowToggleSwitch.OnContent
source: Always open new window
th_th: เปิดหน้าต่างใหม่เสมอ

# AdvancedPage_LaunchPreferenceSettings_Title.Text
source: Launch Preferences
th_th: การกำหนดลักษณะการเปิดโปรแกรม

# TextAndEditorPage_LineHighlighterSettings_ToggleSwitch.OffContent
source: Show border around current line
th_th: เน้นบรรทัดปัจจุบัน

# TextAndEditorPage_LineHighlighterSettings_ToggleSwitch.OnContent
source: Show border around current line
th_th: เน้นบรรทัดปัจจุบัน

# TextAndEditorPage_SearchEngineSettings_CustomSearchUrlRadioButton.Text
source: Custom Search Engine
th_th: เครื่องมือค้นหาที่กำหนดเอง

source: *Enter a url of format https://www.example.com/search?q={0}
th_th: *ระบุ URL ในรูปแบบ https://www.example.com/search?q={0}

# TextAndEditorPage_SearchEngineSettings_Description.Text
source: Settings for default search engine choosen when a web search is done.
th_th: การตั้งค่าเครื่องมือค้นหาเริ่มต้นเมื่อทำการค้นหาบนเว็บ

# TextAndEditorPage_SearchEngineSettings_Title.Text
source: Default Search Engine
th_th: เครื่องมือค้นหาเริ่มต้น

# TextAndEditorPage_DecodingSettings_AutoGuessRadioButton.Content
source: Auto guess Encoding (Recommended)
th_th: ตรวจหาการเข้ารหัสอัตโนมัติ (แนะนำ)
